## Pandas

In [1]:
# !pip install pandas -q

### Pandas is library
### Use Cases : Data cleaning,data manipulation,data tramsformation,Filtering

In [2]:
import pandas as pd

#### Creating a CSV files ---->Comma seperated values

In [3]:
id_ = [1,2,3,4,5]
name = ['ram','shyam','Hari','Suresh','Global']
salary = [50000,10000,15000,30000,500000]
address = ['Kathmandu','Lalitpur','Bharatpur','Pokhara','palpa']

In [4]:
dicts = {
    'id' :id_, 'name': name , 'salary': salary, 'address':address
}
dicts

{'id': [1, 2, 3, 4, 5],
 'name': ['ram', 'shyam', 'Hari', 'Suresh', 'Global'],
 'salary': [50000, 10000, 15000, 30000, 500000],
 'address': ['Kathmandu', 'Lalitpur', 'Bharatpur', 'Pokhara', 'palpa']}

### creating a Dataframe

In [5]:
df = pd.DataFrame(dicts)

In [6]:
df

   id    name  salary    address
0   1     ram   50000  Kathmandu
1   2   shyam   10000   Lalitpur
2   3    Hari   15000  Bharatpur
3   4  Suresh   30000    Pokhara
4   5  Global  500000      palpa

In [7]:
type(df)

pandas.core.frame.DataFrame

### Save a df to csv file

In [8]:
df.to_csv(r'C:\Users\97798\Desktop\Files\aboved.csv')

### By default above data will come with index so to remove it it do as follows:

In [9]:
df.to_csv(r'C:\Users\97798\Desktop\Files\aboved.csv',index= False)

### Reading the CSV files:

In [10]:
df1 = pd.read_csv(r'C:\Users\97798\Desktop\Files\aboved.csv')

In [11]:
df1

   id    name  salary    address
0   1     ram   50000  Kathmandu
1   2   shyam   10000   Lalitpur
2   3    Hari   15000  Bharatpur
3   4  Suresh   30000    Pokhara
4   5  Global  500000      palpa

### Reading data from movie Datasets

In [14]:
df = pd.read_csv(r'C:\Users\97798\Documents\ds_files\movies.csv')

In [15]:
df

,Series_Title,Released_Year,Runtime,Genre,IMDB_Rating,Director,Star1,No_of_Votes,Gross,Metascore
0,Chinatown,1974,130,Drama,8.1,Roman Polanski,Jack Nicholson,294230,29000000.0,92.0
1,The Girl with the Dragon Tattoo,2011,158,Crime,7.8,David Fincher,Daniel Craig,423010,102515793.0,71.0
2,Nueve reinas,2000,114,Crime,7.9,Fabián Bielinsky,Ricardo Darín,49721,1221261.0,80.0
3,Close Encounters of the Third Kind,1977,138,Drama,7.6,Steven Spielberg,Richard Dreyfuss,184966,132088635.0,90.0
4,Joker,2019,122,Crime,8.5,Todd Phillips,Joaquin Phoenix,939252,335451311.0,59.0
...,...,...,...,...,...,...,...,...,...,...
295,Kumonosu-jô,1957,110,Drama,8.1,Akira Kurosawa,Toshirô Mifune,46678,612604239.0,NaN
296,Falling Down,1993,113,Action,7.6,Joel Schumacher,Michael Douglas,171640,40903593.0,56.0
297,The Royal Tenenbaums,2001,110,Comedy,7.6,Wes Anderson,Gene Hackman,266842,52364010.0,76.0
298,Midnight Cowboy,1969,113,Drama,7.8,John Schlesinger,Dustin Hoffman,101124,44785053.0,79.0
299,Kai po che!,2013,130,Drama,7.7,Abhishek Kapoor,Amit Sadh,32628,1122527.0,40.0